Repository: mpolk/glacier
Catalog: *.po
Languages: ru

source: No write access to DB! Operation aborted.
ru: Отсутствует доступ на запись в БД! Операция запрещена.

source: Upload failed!
ru: Неудачная загрузка архива!

source: \n Total %d MiB in %d archives\n\n
ru: \n Всего %d МиБ в %d архивах\n\n

source: <INVENTORY>
ru: <ИНВЕНТАРИЗАЦИЯ>

source: No such archive: %s!
ru: Нет такого архива: %s!

source: Are you sure you want to delete acrhive %s%s? (yes/no)
ru: Вы действительно хотите удалить архив %s%s? (yes/no)

source: Deleting archive "%s"...
ru: Удаляем архив "%s"...

source: Deletion failed!
ru: Неудачная попытка удаления архива!

source: Inventory request already sent to AWS.
ru: Запрос на инвентаризацию уже отправлен в AWS.

source: Sending another request usually does not make any sense.
ru: Отправка еще одного запроса вряд ли целесообразна.

source: If you still believe sending one more request is required, add "-f" option.
ru: Если вы считаете, что послать повторный запрос все-таки надо, добавьте ключ -f.

source: Job initialization failed!
ru: Неудача при инициализации задания!

source: Inventory request sent to AWS
ru: Запрос на инвентаризацию направлен в хранилище

source: Trying to reload storage inventory results...
ru: Обновляем результаты инвентаризации хранилища...

source: Job status request failed!
ru: Неудача при попытке получить состояние задания!

source: Inventory request is not fulfilled yet, data is not refreshed
ru: Запрос на инветаризацию еще не выполнен, данные не обновлены

source: Inventory results load failed!
ru: Неудача при попытке загрузить результаты инвентаризации!

source: No inventory was completed yet.
ru: На данный момент не было выполнено ни одной инвентаризации.

source: Now inventory will be requested.
ru: Сейчас инвентаризация хранилища будет запрошена.

source: Its result will be ready after some hours.
ru: Ее результаты вы сможете увидеть позже, в течение нескольких часов.

source: Storage inventory was requested before, but its results could not be loaded.
ru: Инвентаризация хранилища была запрошена ранее, но результаты ее загрузить не удалось.

source: Try to request an inventory once more.
ru: Попробуйте запросить инвентаризацию еще раз.

source: Currently there are no outstanding inventory requests
ru: На данный момент нет ни одного невыполненного запроса на инвентаризацию

source: Inventory results loaded successfully
ru: Результаты инвентаризации успешно загружены в БД

source: Inventory of %s\n
ru: Инвентаризация от %s\n

source: Archive "%s" presents in Glacier, but its record is missing from the directory\n
ru: Архив "%s" имеется в хранилище, но отсутствует в каталоге\n

source: Record it to the directory?
ru: Занести его в каталог?

source: Archive "%s" presents in Glacier, but is removed from the directory\n
ru: Архив "%s" имеется в хранилище, но удален из каталога\n

source: Restore it?
ru: Восстановить его?

source: Filename of the archive "%s" does not match with that in the directory:\n
ru: Имя файла архива "%s" не совпадает с таковым в каталоге:\n

source: In Glacier: %s\n
ru: В хранилище: %s\n

source: In the directory: %s\n
ru: В каталоге: %s\n

source: Fix data in the directory?
ru: Исправить данные в каталоге?

source: File path of the archive "%s" does not match with that in the directory:\n
ru: Маршрут файла архива "%s" не совпадает с таковым в каталоге:\n

source: File size of the archive "%s" does not match with that in the directory:\n
ru: Размер файла архива "%s" не совпадает с таковым в каталоге:\n

source: Checksum of the archive "%s" does not match with that in the directory:\n
ru: Контрольная сумма файла архива "%s" не совпадает с таковой в каталоге:\n

source: Archive "%s" presents in the directory, but is missing from Glacier\n
ru: Архив "%s" числится в каталоге, но отсутствует в хранилище\n

source: Delete it from the directory?
ru: Удалить его из каталога?

source: There is no such file(s) in the directory!
ru: Указанный(-е) файл(-ы) в каталоге отсутствует(-ют)!

source: Download request for the file %s%s already sent to AWS.\n
ru: Запрос на выгрузку файла %s%s уже отправлен в AWS.\n

source: Download request for the file "%s%s" sent to AWS\n
ru: Запрос на выгрузку файла "%s%s"направлен в хранилище\n

source: Currently there are no outstanding download requests!
ru: Какие-либо невыполненные задания на выгрузку файлов в каталоге отсутствует!

source: Currently there are no download requests for this file(s)!
ru: Запрос(-ы) на выгрузку для указанного файла(-ов) в каталоге отсутствуют!

source: You should request the download with the "request" command
ru: Следует сначала запросить выгрузку файла(-ов) с помощью команды "request"

source: Download request for the file %s%s is not fulfilled yet, file skipped\n
ru: Запрос на выгрузку файла %s%s еще не выполнен, файл пропущен\n

source: Failure to download file %s%s!\n
ru: Неудача при попытке выгрузить файл %s%s!\n

source: No deleted files found
ru: Удаленных файлов в каталоге не найдено

source: Really purge all deleted files? Are you sure?
ru: Действительно вычистить все удаленные файлы? Вы уверены?

source: %d deleted files purged\n
ru: Вычищено %d удаленных файлов\n

source: No completed jobs found
ru: Выполненных заданий в каталоге не найдено

source: Really purge all completed jobs? Are you sure?
ru: Действительно вычистить все выполненные задания? Вы уверены?

source: %d completed jobs purged\n
ru: Вычищено %d выполненных заданий\n

source: You should specify what are going to purge: files|jobs|all
ru: Необходимо указать, что вы хотите вычистить: files|jobs|all

source: Initializing DB...
ru: Инициализируем БД...

source: Could not initialize DB!
ru: Не могу проинициализировать базу данных!

source: utility script for manipulation with AWS Glacier storage
ru: скрипт для выполнения операций с хранилищем AWS Glacier

source: Usage:
ru: Варианты использования скрипта:

source: sends file(s) to Glacier
ru: загрузить файл(-ы) в хранилище

source: shows a directory listing (what is already uploaded)
ru: показать листинг каталога (что у нас уже загружено)

source: shows all files (including the deleted ones)
ru: показывать все файлы (в том числе и удаленные)

source: same as "ls"
ru: то же самое, что и "ls"

source: removes files from Glacier
ru: удалить архив(-ы) из хранилища

source: same as "rm"
ru: то же самое, что и "rm"

source: requests file download from Glacier
ru: запросить выгрузку файла(-ов) из хранилища

source: requests Glacier inventory
ru: запросить инвентаризацию хранилища

source: downloads file(s) from Glacier (after request is fulfilled)
ru: выгрузить файла(-ов) из хранилища (после выполнения запроса)

source: downloads file with the alternate name/to alternate location
ru: выгрузить файл под другим именем/в другое место

source: shows inventory results
ru: показать результаты инвентаризации

source: requests inventory, same as "request -"
ru: запросить инвентаризацию, то же, что "request -"

source: requests a new inventory even if the previous one is marked as incomplete
ru: запросить новую инвентаризацию, даже если предыдущий запрос значится невыполненным

source: checks the last inventory request results and store them to DB if they are ready
ru: проверить результат выполнения запроса и в случае успеха сохранить его в БД

source: synchronizes directory with the last inventory results
ru: синхронизировать каталог с результатами последней инвентаризации

source: checks for mismatches but doesn't write anything to DB
ru: выполнить проверку на расхождение, но не писать ничего в БД

source: implies "yes" for all the questions
ru: автоматически подразумевать положительный ответ на все вопросы

source: shows the list of jobs (requests) for download or inventory
ru: показать список заданий на выгрузку файлов и инвентаризацию

source: shows all jobs (including the completed ones)
ru: показывать все задания (в том числе и завершенные)

source: purges deleted files and completed jobs from the directory
ru: вычистить из каталога удаленные файлы и/или выполненные задания

source: Common options for all comands:
ru: Общие ключи для всех команд:

source: tells to use <CONFIG-FILE> instead of the predefined ones
ru: указывает, что нужно использовать <CONFIG-FILE> вместо стандартных файлов конфигурации

source: debugging mode
ru: отладочный режим

source: Common options for directory listing and inventory commands:
ru: Общие ключи для команд листинга и инвентаризации:

source: long listing mode
ru: длинный режим листинга каталога или инвентаризации

source: even longer listing mode
ru: еще более длинный режим листинга каталога или инвентаризации

source: Cannot read config file!
ru: Невозможно прочитать файл конфигурации!

source: No read access to DB!
ru: База данных недоступна для чтения!

source: The \"request\" command requires a parameter (filename template or \"-\")
ru: Команда \"request\" требует обязательного параметра (шаблон имени файла или \"-\")
